Tekla Open API Reference for Tekla Structures 2025
ModelAccess.ConnectToModel Method (Model)
 Gets a model connection.
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static bool ConnectToModel(
	out Model model
)
Public Shared Function ConnectToModel (
	<OutAttribute> ByRef model As Model
) As Boolean
Parameters
model
Type: Tekla.Structures.Model.Model
The model connection.
Return Value
Type: Boolean
True on success. False otherwise.
See Also
Reference
ModelAccess Class
ConnectToModel Overload
Tekla.Structures.Dialog.UIControls Namespace